<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#What-is-a-database" data-toc-modified-id="What-is-a-database-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>What is a database</a></span><ul class="toc-item"><li><span><a href="#DBMS" data-toc-modified-id="DBMS-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>DBMS</a></span></li><li><span><a href="#数据库类型" data-toc-modified-id="数据库类型-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>数据库类型</a></span></li></ul></li><li><span><a href="#Table-&amp;-Keys" data-toc-modified-id="Table-&amp;-Keys-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Table &amp; Keys</a></span></li><li><span><a href="#SQL-Basics" data-toc-modified-id="SQL-Basics-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>SQL Basics</a></span></li><li><span><a href="#Tables操作" data-toc-modified-id="Tables操作-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Tables操作</a></span><ul class="toc-item"><li><span><a href="#数据类型：" data-toc-modified-id="数据类型：-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>数据类型：</a></span></li><li><span><a href="#创建表" data-toc-modified-id="创建表-4.2"><span class="toc-item-num">4.2&nbsp;&nbsp;</span>创建表</a></span></li><li><span><a href="#查看表结构" data-toc-modified-id="查看表结构-4.3"><span class="toc-item-num">4.3&nbsp;&nbsp;</span>查看表结构</a></span></li><li><span><a href="#删除表" data-toc-modified-id="删除表-4.4"><span class="toc-item-num">4.4&nbsp;&nbsp;</span>删除表</a></span></li><li><span><a href="#增加一列" data-toc-modified-id="增加一列-4.5"><span class="toc-item-num">4.5&nbsp;&nbsp;</span>增加一列</a></span></li><li><span><a href="#删除一列" data-toc-modified-id="删除一列-4.6"><span class="toc-item-num">4.6&nbsp;&nbsp;</span>删除一列</a></span></li><li><span><a href="#关键字限制:-NOT-NULL,-DEFAULT,-UNIQUE" data-toc-modified-id="关键字限制:-NOT-NULL,-DEFAULT,-UNIQUE-4.7"><span class="toc-item-num">4.7&nbsp;&nbsp;</span>关键字限制: NOT NULL, DEFAULT, UNIQUE</a></span></li><li><span><a href="#关键字限制：-AUTO_INCREMENT" data-toc-modified-id="关键字限制：-AUTO_INCREMENT-4.8"><span class="toc-item-num">4.8&nbsp;&nbsp;</span>关键字限制： AUTO_INCREMENT</a></span></li><li><span><a href="#外键" data-toc-modified-id="外键-4.9"><span class="toc-item-num">4.9&nbsp;&nbsp;</span>外键</a></span></li></ul></li><li><span><a href="#插入数据" data-toc-modified-id="插入数据-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>插入数据</a></span></li><li><span><a href="#Update-&amp;-Delete" data-toc-modified-id="Update-&amp;-Delete-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>Update &amp; Delete</a></span></li><li><span><a href="#Basic-Query" data-toc-modified-id="Basic-Query-7"><span class="toc-item-num">7&nbsp;&nbsp;</span>Basic Query</a></span></li><li><span><a href="#案例表格" data-toc-modified-id="案例表格-8"><span class="toc-item-num">8&nbsp;&nbsp;</span>案例表格</a></span></li><li><span><a href="#Functions" data-toc-modified-id="Functions-9"><span class="toc-item-num">9&nbsp;&nbsp;</span>Functions</a></span><ul class="toc-item"><li><span><a href="#count：-计数" data-toc-modified-id="count：-计数-9.1"><span class="toc-item-num">9.1&nbsp;&nbsp;</span>count： 计数</a></span></li><li><span><a href="#AVG:-平均数" data-toc-modified-id="AVG:-平均数-9.2"><span class="toc-item-num">9.2&nbsp;&nbsp;</span>AVG: 平均数</a></span></li></ul></li><li><span><a href="#Wildcards:-通配符" data-toc-modified-id="Wildcards:-通配符-10"><span class="toc-item-num">10&nbsp;&nbsp;</span>Wildcards: 通配符</a></span><ul class="toc-item"><li><span><a href="#%" data-toc-modified-id="%-10.1"><span class="toc-item-num">10.1&nbsp;&nbsp;</span>%</a></span></li><li><span><a href="#_" data-toc-modified-id="_-10.2"><span class="toc-item-num">10.2&nbsp;&nbsp;</span>_</a></span></li></ul></li><li><span><a href="#Union" data-toc-modified-id="Union-11"><span class="toc-item-num">11&nbsp;&nbsp;</span>Union</a></span></li><li><span><a href="#Join" data-toc-modified-id="Join-12"><span class="toc-item-num">12&nbsp;&nbsp;</span>Join</a></span><ul class="toc-item"><li><span><a href="#inner-join-->-join" data-toc-modified-id="inner-join-->-join-12.1"><span class="toc-item-num">12.1&nbsp;&nbsp;</span>inner join -&gt; join</a></span></li><li><span><a href="#right-join-vs-left-join" data-toc-modified-id="right-join-vs-left-join-12.2"><span class="toc-item-num">12.2&nbsp;&nbsp;</span>right join vs left join</a></span></li></ul></li><li><span><a href="#嵌套查询" data-toc-modified-id="嵌套查询-13"><span class="toc-item-num">13&nbsp;&nbsp;</span>嵌套查询</a></span></li><li><span><a href="#trigger" data-toc-modified-id="trigger-14"><span class="toc-item-num">14&nbsp;&nbsp;</span>trigger</a></span></li><li><span><a href="#课程信息" data-toc-modified-id="课程信息-15"><span class="toc-item-num">15&nbsp;&nbsp;</span>课程信息</a></span></li><li><span><a href="#参考资料" data-toc-modified-id="参考资料-16"><span class="toc-item-num">16&nbsp;&nbsp;</span>参考资料</a></span></li></ul></div>

# What is a database

任何相关数据的结集合都是一个Database(DB)

## DBMS

Database Management Systems (DBMS)是一个很特别的程序，允许用户创建和管理大量数据。提供安全性、备份、导入和导出数据，并发访问数据，以及与软件应用交互。

## 数据库类型

有两种主要的数据库类型：
+ 关系型数据库（SQL）：数据被组织为一个或者多个表，每个表有许多行和列。使用唯一的键来表征一条数据

RDBMS（关系型数据库管理系统），比如MySQL, Oracle, postgreSQL, mariaDB等

+ 非关系型数据库(No-SQL)：数据被组织为任何东西，比如键值对，json，XML，图，文本等

NRDBMS(非关系型数据库管理系统)：mongoDB, dynamoDB, apache cassandra, firebase

# Table & Keys

`foreign key`: 外键，是另外一个表的主键，使用这个列可以追溯另外一个表中对应的数据。


`branch_id`是表`Employee`的外键，是表Branch中的主键

# SQL Basics

总共有四种类型的操作
+ Data Query Language (DQL): 查询信息
+ Data Definition Language (DDL): 定义表schema信息
+ Data Control Language (DCL)：控制用户权限
+ Data Manipulation Lanuage (DML)：增删改数据

# Tables操作

## 数据类型：
+ INT
+ DECIMAL(10, 4):10位数，其中4位是小数位
+ VARCHAR(10): 长度为10的字符串
+ BLOB: 二进制数据
+ DATE： 日期数据，YYYY-MM-DD
+ TIMESTAMP: 时间戳，YYYY-MM-DD HH:MM:SS

## 创建表

```SQL
CREATE TABLE student (
    student_id INT PRIMARY KEY,
    name VARCHAR(20),
    major VARCHAR(20)
);
```

这种方法可以用于指定复合主键
```SQL
CREATE TABLE student (
    student_id INT,
    name VARCHAR(20),
    major VARCHAR(20),
    PRIMARY KEY (student_id)
);
```

## 查看表结构


```SQL
DESCRIBE student;
```

```
+------------+-------------+------+-----+-----------+----------------+
| Field      | Type        | Null | Key | Default   | Extra          |
+------------+-------------+------+-----+-----------+----------------+
| student_id | int(11)     | NO   | PRI | NULL      | auto_increment |
| name       | varchar(20) | NO   |     | NULL      |                |
| major      | varchar(20) | YES  |     | undecided |                |
+------------+-------------+------+-----+-----------+----------------+
```

## 删除表

```SQL
DROP TABLE student;
```

## 增加一列

```SQL
ALTER TABLE student ADD gpa DECIMAL(3, 2);
```

## 删除一列
```SQL
ALTER TABLE student DROP COLUMN gpa;
```

## 关键字限制: NOT NULL, DEFAULT, UNIQUE

```SQL
CREATE TABLE student (
    student_id INT,
    name VARCHAR(20) NOT NULL,
    major VARCHAR(20) DEFAULT 'undecided',
    PRIMARY KEY (student_id)
);

INSERT INTO student(student_id, name) VALUES(6, 'Mike');
```

## 关键字限制： AUTO_INCREMENT

```SQL
CREATE TABLE student (
    student_id INT AUTO_INCREMENT,
    name VARCHAR(20) NOT NULL,
    major VARCHAR(20) DEFAULT 'undecided',
    PRIMARY KEY (student_id)
);

INSERT INTO student(name, major) VALUES('Mike', 'Math');
```

```
+------------+--------+-----------+
| student_id | name   | major     |
+------------+--------+-----------+
|          1 | Jack   | Biology   |
|          2 | Kate   | Sociology |
|          3 | Claire | Chemistry |
|          4 | Jack   | Biology   |
|          5 | Mike   | Comp. Sci |
|          6 | Mike   | Math      |
+------------+--------+-----------+
```

## 外键


+ 创建表时指定外键

```SQL
CREATE TABLE branch (
  branch_id INT PRIMARY KEY,
  branch_name VARCHAR(40),
  mgr_id INT,
  mgr_start_date DATE,
  FOREIGN KEY(mgr_id) REFERENCES employee(emp_id) ON DELETE SET NULL
);

CREATE TABLE works_with (
    emp_id INT,
    client_id INT,
    total_sales INT,
    PRIMARY KEY (emp_id, client_id),
    FOREIGN KEY (emp_id) REFERENCES employee(emp_id) ON DELETE CASCADE,
    FOREIGN KEY (client_id) REFERENCES client(client_id) ON DELETE CASCADE
);
```


**ON DELETE SET NULL**： 设置当被参照数据被删除时，参照这个数据的那些数据对应位置被置空。 **ON DELETE CASCADE:** 当被参照数据被删除时，参照这个数据的那些数据也被删除

+ 创建表后，增加外键

```SQL
ALTER TABLE employee
ADD FOREIGN KEY(branch_id)
REFERENCES branch(branch_id)
ON DELETE SET NULL;
```

# 插入数据

+ 方法1：
```SQL
INSERT INTO student VALUES(7, 'Jack', 'Biology');
```

```
+------------+--------+-----------+
| student_id | name   | major     |
+------------+--------+-----------+
|          1 | Jack   | Biology   |
|          2 | Kate   | Sociology |
|          3 | Claire | Chemistry |
|          4 | Jack   | Biology   |
|          5 | Mike   | Comp. Sci |
|          6 | Mike   | Math      |
|          7 | Jack   | Biology   |
+------------+--------+-----------+
```

+ 方法2：插入空值数据

```SQL
INSERT INTO student(student_id, name) VALUES(3, 'Claire');
```

```
+------------+--------+-----------+
| student_id | name   | major     |
+------------+--------+-----------+
|          1 | Jack   | Biology   |
|          2 | Kate   | Sociology |
|          3 | Claire | Chemistry |
|          4 | Jack   | Biology   |
|          5 | Mike   | Comp. Sci |
|          6 | Mike   | Math      |
|          7 | Jack   | Biology   |
|          8 | Claire | undecided |
+------------+--------+-----------+
```

# Update & Delete

+ Update

```SQL
UPDATE student
SET major  = 'M'
WHERE major = 'Math';
```

+ Delete

```SQL
DELETE FROM student
WHERE student_id = 1;
```

# Basic Query

+ LIMIT

```SQL
SELECT name FROM student LIMIT 2;

```

```
+------+
| name |
+------+
| Jack |
| Kate |
+------+
```

+ 不等于： <>, !=

```SQL
SELECT name FROM student WHERE name != 'Kate';

SELECT name FROM student WHERE name <> 'Kate';
```


```
+--------+
| name   |
+--------+
| Jack   |
| Claire |
| Jack   |
| Mike   |
| Mike   |
| Jack   |
| Claire |
+--------+
```

+ IN

``` SQL
SELECT name FROM student WHERE name IN ('Kate', 'Claire');

```


```
+--------+
| name   |
+--------+
| Kate   |
| Claire |
| Claire |
+--------+
```

# 案例表格

```
mysql> select * from employee;
+--------+------------+-----------+------------+------+--------+----------+-----------+
| emp_id | first_name | last_name | birth_day  | sex  | salary | super_id | branch_id |
+--------+------------+-----------+------------+------+--------+----------+-----------+
|    100 | David      | Wallace   | 1967-11-17 | M    | 250000 |     NULL |         1 |
|    101 | Jan        | Levinson  | 1961-05-11 | F    | 110000 |      100 |         1 |
|    102 | Michael    | Scott     | 1964-03-15 | M    |  75000 |      100 |         2 |
|    103 | Angela     | Martin    | 1971-06-25 | F    |  63000 |      102 |         2 |
|    104 | Kelly      | Kapoor    | 1980-02-05 | F    |  55000 |      102 |         2 |
|    105 | Stanley    | Hudson    | 1958-02-19 | M    |  69000 |      102 |         2 |
|    106 | Josh       | Porter    | 1969-09-05 | M    |  78000 |      100 |         3 |
|    107 | Andy       | Bernard   | 1973-07-22 | M    |  65000 |      106 |         3 |
|    108 | Jim        | Halpert   | 1978-10-01 | M    |  71000 |      106 |         3 |
|    109 | Oscar      | Martinez  | 1968-02-19 | M    |  69000 |      106 |         3 |
|    111 | Pam        | Beesly    | 1988-02-19 | F    |  69000 |      106 |         3 |
|    119 | Pam        | Beesly    | 1988-02-19 | F    |  69000 |      106 |         3 |
+--------+------------+-----------+------------+------+--------+----------+-----------+

mysql> select * from branch;
+-----------+-------------+--------+----------------+
| branch_id | branch_name | mgr_id | mgr_start_date |
+-----------+-------------+--------+----------------+
|         1 | Corporate   |    100 | 2006-02-09     |
|         2 | Scranton    |    102 | 1992-04-06     |
|         3 | Stamford    |    106 | 1998-02-13     |
|         4 | Buffalo     |   NULL | NULL           |
+-----------+-------------+--------+----------------+

mysql> select * from works_with;
+--------+-----------+-------------+
| emp_id | client_id | total_sales |
+--------+-----------+-------------+
|    102 |       401 |      267000 |
|    102 |       406 |       15000 |
|    105 |       400 |       55000 |
|    105 |       404 |       33000 |
|    105 |       406 |      130000 |
|    107 |       403 |        5000 |
|    107 |       405 |       26000 |
|    108 |       402 |       22500 |
|    108 |       403 |       12000 |
+--------+-----------+-------------+
```

# Functions

## count： 计数

```SQL
select count(emp_id) from employee where sex = 'M' and birth_day > '1970-01-01';
```

```
+---------------+
| count(emp_id) |
+---------------+
|             2 |
+---------------+
```

## AVG: 平均数

```SQL
select AVG(salary) from employee;
```

```
+-------------+
| AVG(salary) |
+-------------+
|  92888.8889 |
+-------------+
```

# Wildcards: 通配符

## % 

匹配任意字符串，可以没有、有一个或者有多个字符

```SQL
select * from employee where first_name LIKE '%David';
```

```
+--------+------------+-----------+------------+------+--------+----------+-----------+
| emp_id | first_name | last_name | birth_day  | sex  | salary | super_id | branch_id |
+--------+------------+-----------+------------+------+--------+----------+-----------+
|    100 | David      | Wallace   | 1967-11-17 | M    | 250000 |     NULL |         1 |
+--------+------------+-----------+------------+------+--------+----------+-----------+
```

```SQL
select * from employee where first_name LIKE '%l%';
```

```
+--------+------------+-----------+------------+------+--------+----------+-----------+
| emp_id | first_name | last_name | birth_day  | sex  | salary | super_id | branch_id |
+--------+------------+-----------+------------+------+--------+----------+-----------+
|    102 | Michael    | Scott     | 1964-03-15 | M    |  75000 |      100 |         2 |
|    103 | Angela     | Martin    | 1971-06-25 | F    |  63000 |      102 |         2 |
|    104 | Kelly      | Kapoor    | 1980-02-05 | F    |  55000 |      102 |         2 |
|    105 | Stanley    | Hudson    | 1958-02-19 | M    |  69000 |      102 |         2 |
+--------+------------+-----------+------------+------+--------+----------+-----------+
```

## _

表示一个字符，一定要有

```SQL
select * from employee where first_name LIKE '_David';

```

```
Empty set (0.00 sec)
```

# Union

合并多个select的结果，必须保证每个select的结果列的个数是一样的，并且对应列的类型也是一样的。

```SQL
-- 找到用户属于哪个分公司
SELECT client.client_name AS Non_Employee_Entities, client.branch_id AS Branch_ID
FROM client
UNION
SELECT branch_supplier.supplier_name, branch_supplier.branch_id
FROM branch_supplier;
```

```
+-----------------------+-----------+
| Non_Employee_Entities | Branch_ID |
+-----------------------+-----------+
| Dunmore Highschool    |         2 |
| Lackawana Country     |         2 |
| FedEx                 |         3 |
| John Daly Law, LLC    |         3 |
| Scranton Whitepages   |         2 |
| Times Newspaper       |         3 |
| FedEx                 |         2 |
| Hammer Mill           |         2 |
| J.T. Forms & Labels   |         2 |
| Uni-ball              |         2 |
| Hammer Mill           |         3 |
| Patriot Paper         |         3 |
| Stamford Lables       |         3 |
| Uni-ball              |         3 |
+-----------------------+-----------+
```

# Join

```
-- 雇员表
mysql> select * from employee;
+--------+------------+-----------+------------+------+--------+----------+-----------+
| emp_id | first_name | last_name | birth_day  | sex  | salary | super_id | branch_id |
+--------+------------+-----------+------------+------+--------+----------+-----------+
|    100 | David      | Wallace   | 1967-11-17 | M    | 250000 |     NULL |         1 |
|    101 | Jan        | Levinson  | 1961-05-11 | F    | 110000 |      100 |         1 |
|    102 | Michael    | Scott     | 1964-03-15 | M    |  75000 |      100 |         2 |
|    103 | Angela     | Martin    | 1971-06-25 | F    |  63000 |      102 |         2 |
|    104 | Kelly      | Kapoor    | 1980-02-05 | F    |  55000 |      102 |         2 |
|    105 | Stanley    | Hudson    | 1958-02-19 | M    |  69000 |      102 |         2 |
|    106 | Josh       | Porter    | 1969-09-05 | M    |  78000 |      100 |         3 |
|    107 | Andy       | Bernard   | 1973-07-22 | M    |  65000 |      106 |         3 |
|    108 | Jim        | Halpert   | 1978-10-01 | M    |  71000 |      106 |         3 |
+--------+------------+-----------+------------+------+--------+----------+-----------+

```

``` 
-- 分公司表
mysql> select * from branch;
+-----------+-------------+--------+----------------+
| branch_id | branch_name | mgr_id | mgr_start_date |
+-----------+-------------+--------+----------------+
|         1 | Corporate   |    100 | 2006-02-09     |
|         2 | Scranton    |    102 | 1992-04-06     |
|         3 | Stamford    |    106 | 1998-02-13     |
|         4 | Buffalo     |   NULL | NULL           |
+-----------+-------------+--------+----------------+
```

## inner join -> join

只有两个表中对应项都有值才会显示这一行

```SQL
-- 找到雇员对应分公司
select employee.first_name, employee.last_name, branch.branch_name 
from employee inner 
join branch 
ON employee.branch_id = branch.branch_id;
```

```
+------------+-----------+-------------+
| first_name | last_name | branch_name |
+------------+-----------+-------------+
| David      | Wallace   | Corporate   |
| Jan        | Levinson  | Corporate   |
| Michael    | Scott     | Scranton    |
| Angela     | Martin    | Scranton    |
| Kelly      | Kapoor    | Scranton    |
| Stanley    | Hudson    | Scranton    |
| Josh       | Porter    | Stamford    |
| Andy       | Bernard   | Stamford    |
| Jim        | Halpert   | Stamford    |
+------------+-----------+-------------+
```

## right join vs left join

只要right或者left的表有值就会返回

``` SQL
-- 返回所有分公司对应的员工： 这个时候需要返回所有的分公司，所以需要使用right join
select employee.first_name, employee.last_name, branch.branch_name 
from employee 
right join branch 
ON employee.branch_id = branch.branch_id;
```

```
+------------+-----------+-------------+
| first_name | last_name | branch_name |
+------------+-----------+-------------+
| David      | Wallace   | Corporate   |
| Jan        | Levinson  | Corporate   |
| Michael    | Scott     | Scranton    |
| Angela     | Martin    | Scranton    |
| Kelly      | Kapoor    | Scranton    |
| Stanley    | Hudson    | Scranton    |
| Josh       | Porter    | Stamford    |
| Andy       | Bernard   | Stamford    |
| Jim        | Halpert   | Stamford    |
| NULL       | NULL      | Buffalo     |
+------------+-----------+-------------+
```

# 嵌套查询

找到所有交易额大于5000的员工姓名： 首先需要从`works_with`表格中找到交易额大于5000的员工，然后再从`employee`表格中找到对应员工的名字。

```SQL
select first_name, last_name from employee 
where emp_id in 
    (select emp_id from works_with where total_sales > 5000);
```

```
+------------+-----------+
| first_name | last_name |
+------------+-----------+
| Michael    | Scott     |
| Stanley    | Hudson    |
| Andy       | Bernard   |
| Jim        | Halpert   |
+------------+-----------+
```

# trigger

触发器定义了，当在某个表上执行某种操作时会触发的操作。

```SQL
-- 创建一个表
create table trigger_test (message varchar(40));
```

现在定义一个触发器，每当我们向employee表中插入数据之前，都会向trigger_test插入一条数据

```SQL
DELIMITER $$
CREATE
    TRIGGER my_trigger BEFORE INSERT
    ON employee
    FOR EACH ROW BEGIN
        INSERT INTO trigger_test VALUES('added new employee');
    END$$
DELIMITER ;
```

`DELIMITER $$`的作用是修改分隔符为`$$`，这样当遇到`$$`的时候语句才会执行，而不会在`FOR EACH ROW BEGIN`中执行下面的那条语句

```SQL
INSERT INTO employee
VALUES(109, 'Oscar', 'Martinez', '1968-02-19', 'M', 69000, 106, 3);
```

```
+----------------+
| message        |
+----------------+
| add a employee |
+----------------+
```

可以看到，当插入一个新员工时`trigger_test`表中新增了一条记录

还可以根据插入数据的不同值，来触发不同的动作。

```SQL
DELIMITER $$
CREATE
    TRIGGER my_trigger BEFORE INSERT
    ON employee
    FOR EACH ROW BEGIN
         IF NEW.sex = 'M' THEN
               INSERT INTO trigger_test VALUES('added male employee');
         ELSEIF NEW.sex = 'F' THEN
               INSERT INTO trigger_test VALUES('added female');
         ELSE
               INSERT INTO trigger_test VALUES('added other employee');
         END IF;
    END$$
DELIMITER ;
```

```
+----------------+
| message        |
+----------------+
| add a employee |
| add a employee |
| added female   |
+----------------+
```

# 课程信息

课程视频地址： https://www.youtube.com/watch?v=HXV3zeQKqGY

整个课程只有4个小时，介绍了SQL基本的入门知识，所以只有一个视频：

```
(0:00) Introduction
(2:36) What is a Database?
(23:10) Tables & Keys
(43:31) SQL Basics
(52:26) MySQL Windows Installation
(1:01:59) MySQL Mac Installation
(1:15:49) Creating Tables
(1:31:05) Inserting Data
(1:38:17) Constraints
(1:48:11) Update & Delete
(1:56:11) Basic Queries
(2:08:37) Company Database Intro
(2:14:05) Creating Company Database
(2:30:27 ) More Basic Queries
(2:26:24) Functions
(2:45:13) Wildcards
(2:53:53) Union
(3:01:36) Joins
(3:11:49) Nested Queries
(3:21:52) On Delete
(3:30:05) Triggers
(3:42 12) FR Diagrams Intro
(3:55:53) Designing an ER Diagram
(4:08:34) Converting ER Diagrams to Schemas
```



课程中使用的代码：https://www.mikedane.com/databases/sql/creating-company-database/

# 参考资料
w3school: [https://www.w3school.com.cn/sql/sql_quickref.asp](https://www.w3school.com.cn/sql/sql_quickref.asp)